---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.WallSweepWallSubcategoryId
source: html/6f7e03fe-b8a0-a06e-7fb6-2628ee15c379.htm
---
# Autodesk.Revit.DB.ParameterTypeId.WallSweepWallSubcategoryId Property

"Subcategory of Walls"

## Syntax (C#)
```csharp
public static ForgeTypeId WallSweepWallSubcategoryId { get; }
```